Repository: nivbp7/IBI
Catalog: IBI/Localization/Localizable.xcstrings
Source language: en
Languages: he

source: Authenticate to access your account
he: אימות כדי להכנס לחשבון

source: Authenticate with Face ID/Touch ID
he: אימות עם זיהוי פנים/אצבע

source: Authentication failed
he: אימות נכשל

source: Brand unknown
he: חברה לא ידועה

source: Brand:
he: חברה:

source: Cancel
he: ביטול

source: Dark
he: כהה

source: Display
he: תצוגה

source: English
he: אנגלית

source: Error
he: שגיאה

source: Error fetching products
he: נכשלה בקשת מוצרים

source: Favorites
he: מועדפים

source: Hebrew
he: עברית

source: Incorrect username or password
he: שם משתמש או סיסמא אינם נכונים

source: Language
he: שפה

source: Language Changed
he: שפה השתנתה

source: Light
he: בהירה

source: Login
he: התחבר/י

source: Login Screen
he: מסך כניסה

source: logout
he: התנתק/י

source: Logout
he: התנתק/י

source: OK
he: המשך

source: Password
he: סיסמא

source: Please enter a valid username and password
he: אנא הכנס/י שם משתמש וסיסמא מתאימים

source: Please restart the app to apply the new language.
he: אנא אתחל/י את האפליקציה כדי להציג את השפה החדשה

source: Price:
he: מחיר:

source: Products
he: מוצרים

source: Reload
he: טעינה מחדש

source: Settings
he: הגדרות

source: Use Passcode
he: השמתש/י בסיסמא

source: Username
he: שם משמתש

source: Your device does not support this feature
he: אימות לא נתמך במכשירך
